token = "" #


startMsg = "Привет! Меня зовут BestCryptoInsideBot," \
           " я создан для постоянного сопровождения вас в криптовалютной биржевой торговле.\n\n" \
           "Я с радостью помогу вам:\n" \
           "1. Создать высокодоходный инвестиционный портфель.\n" \
           "2. Получать самую актуальную и свежую информацию по всему рынку криптовалют.\n" \
           "3. Получить инструменты для автоматизации и удобства торговли.\n" \
           "4. Приумножить ваш капитал и обрести финансовую независимость.\n" \
           "Ну что, начнем наше путешествие по социальной торговой платформе?" \
           " Или сначала ознакомитесь с результатами?\n" \
           "https://t.me/results_crypto_signal\n\n" \
           "<b>Ваш ID: %s</b>"

marketingMsg = "Рекомендуй BestCryptoInsideBot своим друзьям и знакомым и получай моментальные выплаты" \
               " на свой BitCoin кошелек за каждую активацию подписки на 3 уровня в глубину:\n" \
               "1 уровень - <b>10 %</b>\n" \
               "2 уровень - <b>4 %</b>\n" \
               "3 уровень - <b>1 %</b>\n\n"

startWorkMsg = "Вам необходимо активировать подписку для пользования функционалом бота." \
               " Рекомендую подписаться на новостной канал в Telegram и на соц. сети," \
               " все материалы публикуемые там бесплатны!" \
               " Активируя аккаунт Вы автоматически соглашаетесь с условиями использования бота."

conditionsMsg = "Вся информация, предоставляемой BestCryptoInsideBot, является частной собственностью" \
                " и защищена законом «О защите информации». " \
                "Распространение и размещение информации на сторонних ресурсах строго запрещено!" \
                " При несоблюдении данного правила личный кабинет нарушителя блокируется без права на восстановление."

channelLink = "link on a channel"
profitMsg = "Активировав подписку на BestCryptoInsideBot вы получите:\n" \
            "* Помощь в формировании высокодоходного инвестиционного портфеля.\n" \
            "* Инструменты для автоматизации и удобства ведения торговли.\n" \
            "* Рассылку актуальной и свежей информации криптовалютного рынка.\n" \
            "* Сигналы для совершения краткосрочных прибыльных сделок."
paymentMsg = 'Отправьте точно <b>{0}</b> BTC на адрес <b>{1}</b>\n ' \
             'Ваша подписка будет автоматически активирована после одного подтверждения в сети BitCoin.\n' \
             'Скорость получения подписки зависит от установленной Вами комиссии транзакции. '
aboutMsg = "Наша команда профессионалов, занимается биржевой торговлей криптовалют, более чем 3 года. " \
           "Так же мы сотрудничаем с другими трейдерами, " \
           "и у нас проплачены все информационные каналы которые известны нам. " \
           "Наша цель, минимизировать в первую очередь свои затраты на информацию. " \
           "Вам не нужно быть профессионалом в биржевой торговли, все это мы берем на себя. " \
           "Все что вам нужно, это вовремя реагировать на информацию.\n" \
           "У вас активная демо-подписка.\n" \
           "Вы получаете лишь небольшую часть сигналов. " \
           "Для получения доступа ко всем сигналам Вам необходимо купить VIP подписку в меню бота."

days15 = 0.018
days30 = 0.030
days60 = 0.055
days90 = 0.07
days_forever = 0.07

# ГЛАВНОГО АДМИНА В НАЧАЛО!!!!!!!!!!
sysadmin = 256711367
admin = [399004222, 211439710, 248835526, 256711367]  # KH9IZ ГЛАВНОГО АДМИНА В НАЧАЛО!!!!!!!!!!

values = {}

wallet_id = ""
walletApiKey = ""

listPointer = 0
userList = []
chosenUserId = ""

